[Reference](https://medium.com/gustavorsantos/pandas-melt-a-shortcut-to-tidy-data-ff975570e0c)

In [3]:
import pandas as pd

In [4]:
# Creating a df

df_rows = [ ['Anna', 100, 90, 60, 40, 80, 85],
           ['Charles', 90, 90, 80, 80, 80, 85], 
           ['Bruno', 80, 90, 60, 70, 80, 75], 
           ['Sven', 70, 70, 60, 40, 70, 85],
           ['Harry', 80, 90, 60, 40, 80, 85], 
           ['Dalila', 60, 90, 60, 40, 80, 85], 
           ['Maria', 100, 90, 100, 55, 80, 85], 
           ['Srini', 100, 60, 60, 50, 60, 85],
           ['Marta', 90, 90, 60, 40, 80, 85], 
           ['Dan', 100, 90, 60, 40, 80, 85], 
           ['Shannon', 100, 90, 100, 1000, 80, 85], 
           ['Albert', 50, 90, 50, 40, 80, 85] ]
           
df = pd.DataFrame(df_rows, 
                  columns=['name', 'test1', 'test2', 'test3',    'test4', 'test5', 'test6'])

In [5]:
# Transforming with Pandas Melt
pd.melt(df, 
        id_vars='name',
        value_vars=df.drop('name', axis=1),
        var_name='test',
        value_name='score')

       name   test  score
0      Anna  test1    100
1   Charles  test1     90
2     Bruno  test1     80
3      Sven  test1     70
4     Harry  test1     80
..      ...    ...    ...
67    Srini  test6     85
68    Marta  test6     85
69      Dan  test6     85
70  Shannon  test6     85
71   Albert  test6     85

[72 rows x 3 columns]